app/Controllers/Dashboard.php

SELECT COUNT(*) AS `numrows`
FROM `tbl_addannouncements`
SELECT COUNT(*) AS `numrows`
FROM `tbl_firebase_device`
SELECT COUNT(*) AS `numrows`
FROM `tbl_advertisement`
---
    public function dashboard()
    {
        $data = array();
        $advertisementmodel = new Advertisementmodel();
        $firebasedevicemodel = new Firebasedevicemodel();
        $data["totalapis"] = $this->apimodel->countAllResults();
        $data["totaladdannouncements"] = $this->addannouncements->countAllResults();
        $data["totalnotifications"] = $this->notificationsmodel->where("save","1")->countAllResults();
        $data["totaldevices"] = $firebasedevicemodel->countAllResults();
        $data["totaladvertisement"] = $advertisementmodel->countAllResults();