app/Controllers/Login.php

                            setcookie ("email","");
                            setcookie ("password","");
                        }
                        $this->loginattemptsmodel->where('ip', $ipaddress)->delete();
---
DELETE FROM `tbl_loginattempts`
WHERE `ip` = '59.144.174.71'